---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions
source: html/eb15eae6-8605-5d20-dd45-36990150e5f5.htm
---
# IFCExtrusionCalculatorOptions Properties

The custom axis to try (if extrusionAxes includes an option for a custom direction).